move plantuml to mermaid -- v2
