--- a/src/courses/k8s/cours-k8s-mini.md
+++ b/src/courses/k8s/cours-k8s-mini.md
@@ -146,35 +142,32 @@ node1 -[bold,dashed]right-> svcA #red
 
 - `PersistentVolumeClaim` : associe un `PersistentVolume` (disque virtuel géré par une `StorageClass`) à un/des `Pod`
 
-```plantuml
-@startuml
+```mermaid
+---
+title: PV et PVC
+---
+flowchart TD
 
-title "PV et PVC"
+    %% Composants
+    pv["PersistentVolume"]
+    sc["StorageClass"]
+    db[(Physical Volume)]
+    class sc red
+    class db green
 
-!include <kubernetes/k8s-sprites-unlabeled-25pct>
+    %% Pod et PVC imbriqués
+    subgraph pod ["pod"]
+        pvc["PersistentVolumeClaim"]
+    end
+    class pod blue
 
-skinparam rectangle {
-  RoundCorner 15
-}
-skinparam defaultFontName "Arial"
-skinparam defaultFontSize 14
-
-
-rectangle "<$pv>\nPersistentVolume" as pv
-rectangle "<$sc>\nStorageClass" as sc #Orange
-
-database "Physical Volume" as db #LightGreen
-
-rectangle "<$pod>\npod" as pod #LightBlue {
-  rectangle "<$pvc>\nPersistentVolumeClaim" as pvc {
-}
-
-sc -[dotted]-> pv
-sc -[dotted]up-> pvc
-pv -> db
-
-@enduml
+    %% Relations
+    sc -.-> pv
+    sc -.-> pvc
+    pv --> db
 ```
+
+<div class="caption">StorageClass, PersistentVolume, PersistentVolumeClaim et volume physique.</div>
 
