--- a/src/pages/hibernate/cours.md
+++ b/src/pages/hibernate/cours.md
@@ -29,24 +29,33 @@ Ceci afin d’abstraire l’implémentation de la base de données du code (La p
 
 ## Composants
 
-```plantuml
-@startditaa
+```mermaid
+---
+title: Architecture Hibernate simplifiée
+---
+flowchart TD
 
-+---------------------------------+
-|           Application           |
-+---------------------------------+
-| Classes encapsulant les données |
-+---------------------------------+    +---------------------+
-| cBLU                            |<---| fichiers de mapping |
-|                                 |    +---------------------+
-|          Hibernate              |    +-----------------------------+
-|                                 |<---| propriétés de configuration |
-+---------------------------------+    +-----------------------------+
-|{s}       Base de données        |
-+---------------------------------+
+    subgraph Produit
+        Application
+        data["Classes encapsulant<br/>les données"]
+        orm["Hibernate"]
+        dbms["Base de données"]
+    end
 
-@endditaa
+    mapping["fichiers de mapping"]
+    config["propriétés de configuration"]
+
+    Application --> data
+    data --> orm
+    orm --> dbms
+
+    mapping -.- orm
+    config -.- orm
+
+    class orm,mapping,config blue
 ```
+
+<div class="caption">Intégration d'Hibernate dans l'application.</div>
 
