--- a/src/pages/projet/cdc.md
+++ b/src/pages/projet/cdc.md
@@ -378,23 +378,37 @@ Cette étape marque le début de la phase de réalisation, où la maîtrise d'œ
 #### Exemple de Diagramme de Cas d'Utilisation 📋
 
-Système de gestion de bibliothèque :
+```mermaid
+---
+title: Système de gestion de bibliothèque
+---
+flowchart TD
+    %% Acteurs
+    user(["🧑 Utilisateur"])
+    librarian(["👩‍🏫 Bibliothécaire"])
 
-```plantuml
-@startuml
-actor "Utilisateur" as user
-actor "Bibliothécaire" as librarian
+    %% Cas d'utilisation
+    rechercher(["(Rechercher un livre)"])
+    emprunter(["(Emprunter un livre)"])
+    retourner(["(Retourner un livre)"])
+    inscription(["(S'inscrire à la bibliothèque)"])
+    gerer(["(Gérer les emprunts)"])
+    ajouter(["(Ajouter un nouveau livre)"])
+    supprimer(["(Supprimer un livre)"])
 
-user -> (Rechercher un livre)
-(Rechercher un livre) -> (Emprunter un livre)
-user -> (Retourner un livre)
-librarian -> (Gérer les emprunts)
-librarian -> (Ajouter un nouveau livre)
-librarian -> (Supprimer un livre)
-user --> (S'inscrire à la bibliothèque)
+    %% Relations utilisateur
+    user --> rechercher
+    rechercher --> emprunter
+    user --> retourner
+    user --> inscription
 
-@enduml
+    %% Relations bibliothécaire
+    librarian --> gerer
+    librarian --> ajouter
+    librarian --> supprimer
 ```
+
+<div class="caption">Exemple de diagramme de cas d'utilisation pour un système de gestion d'une librairie.</div>
 
